tests/performance/steady-load-resource-discovery-health.yml
config:
  target: "http://localhost:777"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 25
      name: Sustained User Growth

scenarios:
  - name: "Get Health"
    flow:
      - get:
          url: "/api/v1/health"
  # Other scenarios you can use
  # - name: "Get Discovery Groups"
  #   flow:
  #     - get:
  #         url: "/api/v1/resources/groups"
  # - name: "Get System Info"
  #   flow:
  #     - get:
  #         url: "/api/v1/system"
  # - name: "Discover Cosmos DB accounts (low query)"
  #   flow:
  #     - get:
  #         url: "/api/v1/resources/groups/cosmos-accounts/discover"
  # - name: "Discover Logic Apps workflows (big query)"
  #   flow:
  #     - get:
  #         url: "/api/v1/system"